Table of Contents
 Class VoidResponse
Namespace
IdeaStatiCa.Plugin.Grpc
Assembly
IdeaStatiCa.Plugin.dll
public sealed class VoidResponse : IMessage<VoidResponse>, IEquatable<VoidResponse>, IDeepCloneable<VoidResponse>, IBufferMessage, IMessage
Inheritance
object
VoidResponse
Implements
IMessage<VoidResponse>
IEquatable<VoidResponse>
IDeepCloneable<VoidResponse>
IBufferMessage
IMessage
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Constructors
 VoidResponse()
public VoidResponse()
 VoidResponse(VoidResponse)
public VoidResponse(VoidResponse other)
Parameters
other VoidResponse
Properties
 Descriptor
public static MessageDescriptor Descriptor { get; }
Property Value
MessageDescriptor
 Parser
public static MessageParser<VoidResponse> Parser { get; }
Property Value
MessageParser<VoidResponse>
Methods
 CalculateSize()
Calculates the size of this message in Protocol Buffer wire format, in bytes.
public int CalculateSize()
Returns
int
The number of bytes required to write this message to a coded output stream.
 Clone()
Creates a deep clone of this object.
public VoidResponse Clone()
Returns
VoidResponse
A deep clone of this object.
 Equals(VoidResponse)
Indicates whether the current object is equal to another object of the same type.
public bool Equals(VoidResponse other)
Parameters
other VoidResponse
An object to compare with this object.
Returns
bool
true if the current object is equal to the other parameter; otherwise, false.
 Equals(object)
Determines whether the specified object is equal to the current object.
public override bool Equals(object other)
Parameters
other object
Returns
bool
true if the specified object is equal to the current object; otherwise, false.
 GetHashCode()
Serves as the default hash function.
public override int GetHashCode()
Returns
int
A hash code for the current object.
 MergeFrom(CodedInputStream)
Merges the data from the specified coded input stream with the current message.
public void MergeFrom(CodedInputStream input)
Parameters
input CodedInputStream
Remarks
See the user guide for precise merge semantics.
 MergeFrom(VoidResponse)
Merges the given message into this one.
public void MergeFrom(VoidResponse other)
Parameters
other VoidResponse
Remarks
See the user guide for precise merge semantics.
 ToString()
Returns a string that represents the current object.
public override string ToString()
Returns
string
A string that represents the current object.
 WriteTo(CodedOutputStream)
Writes the data to the given coded output stream.
public void WriteTo(CodedOutputStream output)
Parameters
output CodedOutputStream
Coded output stream to write the data to. Must not be null.
 Edit this page